---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.UnsignedCircuit
source: html/2a2ad6a4-47af-a2d5-1bb4-84c38f9dcf27.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.UnsignedCircuit Property

Circuit is not assigned to a panel

## Syntax (C#)
```csharp
public static FailureDefinitionId UnsignedCircuit { get; }
```